CFD/RiserRef/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;



diameter  0.01;     // 폭
height  0.3;    // 높이
depth  0.1;     // 깊이
nx  20;         // x 방향 셀 수
ny  #calc "($height)/($diameter)*($nx)";
nz  1;          // z 방향 셀 수





vertices
(
    (0.00 0.0 0.00 )
    ($diameter 0.0 0.00 )
    ($diameter $height 0.00 )
    (0.00 $height 0.00 )
    (0.00 0.0 0.025)
    ($diameter 0.0 0.025)
    ($diameter $height 0.025)
    (0.00 $height 0.025)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny 1) simpleGrading ((10 -10) 10 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (1 5 4 0)
    )
    patch outlet
    (
        (3 7 6 2)
    )
    wall walls
    (
        (0 4 7 3)
        (2 6 5 1)
    )
    empty frontAndBackPlanes
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
